renesas/ArduinoCore-rl78g15_fpb_20p/variants/g15-fpb-20p/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/
/*
 * Modified 13 July 2014 by Nozomu Fujita
 * Modified  2 Mar  2017 by Yuuki Okamiya
 * Modified 19 Jul  2022 by Yoshikazu Aono
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#ifndef __RL78__
#include <rl78g15/avr/pgmspace.h>
#else
#include <stdint.h>
#include <stdlib.h>
#endif

#ifndef __RL78__
#define NUM_DIGITAL_PINS            20
#define NUM_ANALOG_INPUTS           6
#else  //__RL78__
    #ifndef BSP_MCU_GROUP_RL78G15  // old code for G23 but not general
        //#define NUM_DIGITAL_PINS            31
        #define NUM_DIGITAL_PINS            57
        #define NUM_ANALOG_INPUTS           10
        #define NUM_SWPWM_PINS              4
    #else  // BSP_MCU_GROUP_RL78G15 (Yes G15)
        #define NUM_DIGITAL_PINS            20
        #define NUM_ANALOG_INPUTS           3  // 20220831 changed from 4->3
        #define NUM_SWPWM_PINS              2
    #endif  // BSP_MCU_GROUP_RL78G15
#endif  //__RL78__

#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 14 : -1)

#if defined(__AVR_ATmega8__)
#define digitalPinHasPWM(p)         ((p) == 9 || (p) == 10 || (p) == 11)
#elif defined(__RL78__)
#define digitalPinHasPWM(p)         ((p) == 3 || (p) == 5 || (p) == 6 || (p) == 9 || (p) == 10 || (p) == 11|| (p) == 22|| (p) == 23|| (p) == 24)
#else
#define digitalPinHasPWM(p)         ((p) == 3 || (p) == 5 || (p) == 6 || (p) == 9 || (p) == 10 || (p) == 11)
#endif

#if 0
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (11)
#define PIN_SPI_MISO  (12)
#define PIN_SPI_SCK   (13)
#ifdef __RL78__
#define PIN_SPI2_SS    (27)
#define PIN_SPI2_MOSI  (28)
#define PIN_SPI2_MISO  (29)
#define PIN_SPI2_SCK   (30)
#endif

static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;
#ifdef __RL78__
static const uint8_t SS2   = PIN_SPI2_SS;
static const uint8_t MOSI2 = PIN_SPI2_MOSI;
static const uint8_t MISO2 = PIN_SPI2_MISO;
static const uint8_t SCK2  = PIN_SPI2_SCK;
#endif
#endif

#ifdef __RL78__
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (36)
#define PIN_SPI_MISO  (37)
#define PIN_SPI_SCK   (38)

#define PIN_SPI3_SS    (27)
#define PIN_SPI3_MOSI  (11)
#define PIN_SPI3_MISO  (12)
#define PIN_SPI3_SCK   (13)

#define PIN_SPI4_SS    (27)
#define PIN_SPI4_MOSI  (35)
#define PIN_SPI4_MISO  (34)
#define PIN_SPI4_SCK   (33)

#define PIN_SPI5_SS    (27)
#define PIN_SPI5_MOSI  (21)
#define PIN_SPI5_MISO  (20)
#define PIN_SPI5_SCK   (19)

static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

static const uint8_t SS3   = PIN_SPI3_SS;
static const uint8_t MOSI3 = PIN_SPI3_MOSI;
static const uint8_t MISO3 = PIN_SPI3_MISO;
static const uint8_t SCK3  = PIN_SPI3_SCK;

static const uint8_t SS4   = PIN_SPI4_SS;
static const uint8_t MOSI4 = PIN_SPI4_MOSI;
static const uint8_t MISO4 = PIN_SPI4_MISO;
static const uint8_t SCK4  = PIN_SPI4_SCK;

static const uint8_t SS5   = PIN_SPI5_SS;
static const uint8_t MOSI5 = PIN_SPI5_MOSI;
static const uint8_t MISO5 = PIN_SPI5_MISO;
static const uint8_t SCK5  = PIN_SPI5_SCK;

#else
#define PIN_SPI_SS    (10)
#define PIN_SPI_MOSI  (11)
#define PIN_SPI_MISO  (12)
#define PIN_SPI_SCK   (13)

static const uint8_t SS   = PIN_SPI_SS;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

#endif


#ifndef __RL78__
#define PIN_WIRE_SDA        (18)
#define PIN_WIRE_SCL        (19)
#else
#define PIN_WIRE_SDA0        (48) // P61
#define PIN_WIRE_SCL0        (47) // P60
#define PIN_WIRE_SDA1        (50) // P63
#define PIN_WIRE_SCL1        (49) // P62

#define PIN_WIRE_SDA0_MASK   0x02 // P61
#define PIN_WIRE_SCL0_MASK   0x01 // P60
#define PIN_WIRE_SDA1_MASK   0x08 // P63
#define PIN_WIRE_SCL1_MASK   0x04 // P62
#endif /*__RL78__*/

static const uint8_t SDA0 = PIN_WIRE_SDA0;
static const uint8_t SCL0 = PIN_WIRE_SCL0;
static const uint8_t SDA1 = PIN_WIRE_SDA1;
static const uint8_t SCL1 = PIN_WIRE_SCL1;

#ifdef GRADZUKI
#define LED_BUILTIN 13
#else
#define LED_BUILTIN 24
#endif

//★逆になっていたので修正
#define BUILTIN_LED1 7
#define BUILTIN_LED2 4

/*
#define PIN_A0   (51)
#define PIN_A1   (52)
#define PIN_A2   (53)
#define PIN_A3   (54)
#define PIN_A4   (55)
#define PIN_A5   (56)
*/
// temporary 2022/09/01
// #define G15_A0 14
// #define G15_A1 15
// #define G15_A2 16

// #define PIN_A0   (51)	/*A0 = ANI2 */
// #define PIN_A1   (52)	/*A1 = ANI3 */
// #define PIN_A2   (53)	/*A2 = ANI4 */
// #define PIN_A3   (54)	/*A3 = ANI5 */
// #define PIN_A4   (55)	/*A4 = ANI6 */
// #define PIN_A5   (56)	/*A5 = ANI7 */

/* add 2021.07.29 */
// #define PIN_A6	(0)		/* ANI16(P03/RxD1) */
// #define PIN_A7	(1)		/* ANI17(P02/TxD1) */
//#define PIN_A8	(29)	/* ANI19(P120) (DIGITAL_PIN_29) */
// #define PIN_A9	(40)	/* ANI18(P147) (DIGITAL_PIN_40) */
/* add 2021.07.29 */

//#define PIN_A6   (20)
//#define PIN_A7   (21)

#define PIN_A0   (14)
#define PIN_A1   (15)
#define PIN_A2   (16)
//#define PIN_A3   (17)
//#define PIN_A4   (18)
//#define PIN_A5   (19)
//#define PIN_A6   (20)
//#define PIN_A7   (21)

static const uint8_t A0 = PIN_A0;
static const uint8_t A1 = PIN_A1;
static const uint8_t A2 = PIN_A2;
// static const uint8_t A3 = PIN_A3;
// static const uint8_t A4 = PIN_A4;
// static const uint8_t A5 = PIN_A5;
/* add 2021.07.29 */
// static const uint8_t A6 = PIN_A6;
// static const uint8_t A7 = PIN_A7;
// static const uint8_t A8 = PIN_A8;
// static const uint8_t A9 = PIN_A9;
/* add 2021.07.29 */

#define digitalPinToPCICR(p)    (((p) >= 0 && (p) <= 21) ? (&PCICR) : ((uint8_t *)0))
#define digitalPinToPCICRbit(p) (((p) <= 7) ? 2 : (((p) <= 13) ? 0 : 1))
#define digitalPinToPCMSK(p)    (((p) <= 7) ? (&PCMSK2) : (((p) <= 13) ? (&PCMSK0) : (((p) <= 21) ? (&PCMSK1) : ((uint8_t *)0))))
#define digitalPinToPCMSKbit(p) (((p) <= 7) ? (p) : (((p) <= 13) ? ((p) - 8) : ((p) - 14)))

