renesas/ArduinoCore-rl78g15_fpb_20p/variants/g15-fpb-20p/pins_arduino.h
#ifndef __RL78__
#define digitalPinToInterrupt(p)  ((p) == 2 ? 0 : ((p) == 3 ? 1 : NOT_AN_INTERRUPT))
#else
// 2022/12/01
// #define digitalPinToInterrupt(p)  ((p) == 2 ? 0 : ((p) == 9 ? 1 : (p) == 10 ? 2 : NOT_AN_INTERRUPT))  // RL78/G15
#define digitalPinToInterrupt(p)  ((p) == 0 ? 0 : ((p) == 2 ? 1 : (p) == 3 ? 2 : NOT_AN_INTERRUPT))  // RL78/G15
#endif

#ifdef __RL78__
/***************************************************************************/
/*    Macro Definitions                                                    */
/***************************************************************************/
#define ADDR_PORT_REG			0xFFFFFF00
#define ADDR_PORT_MODE_REG		0xFFFFFF20
#define ADDR_PORT_PULL_UP_REG	0xFFFF0030
#define	ADDR_PORT_IN_MODE_REG	0xFFFF0040
#define ADDR_PORT_OUT_MODE_REG	0xFFFF0050
#if 0
/* Add for G23 */
#define ADDR_PORT_MODE_CONTROL_A_REG	0xFFFF0060
#define ADDR_PORT_MODE_CONTROL_T_REG	0xFFFF0260
#define ADDR_PORT_MODE_CONTROL_E_REG	0xFFFF0280
#define ADDR_PORT_OUT_CUR_CONTROL_REG	0xFFFF02A8
#define ADDR_PORT_DIG_INPUT_DIS_REG		0xFFFF02B0


/* Add for G23 */
#endif

/* 20220801追加　*/
#define ADDR_PORT_OUT_CUR_CONTROL_REG	0xFFFF02A8
#define ADDR_PORT_DIG_INPUT_DIS_REG		0xFFFF02B0
#define ADDR_PORT_MODE_CONTROL_REG		0xFFFF0060

// 20220831 maintenance for RL78/G15
#define ANALOG_PIN_0		7		// ANI7 (A0 J4-1 DIGITAL_PIN_14)
#define ANALOG_PIN_1		8		// ANI8 (A1 DIGITAL_PIN_15)
#define ANALOG_PIN_2		1		// ANI1 (A2 DIGITAL_PIN_16)
// #define ANALOG_PIN_3		5		// ANI5 (DIGITAL_PIN_54)
// #define ANALOG_PIN_4		6		// ANI6 (DIGITAL_PIN_55)
// #define ANALOG_PIN_5		7		// ANI7 (DIGITAL_PIN_56)
/* add 2021.07.29 */
// #define ANALOG_PIN_6		16		// ANI16(P03/RxD1) (DIGITAL_PIN_0)
// #define ANALOG_PIN_7		17		// ANI17(P02/TxD1) (DIGITAL_PIN_1)
// #define ANALOG_PIN_8		19		// ANI19(P120) (DIGITAL_PIN_29)
// #define ANALOG_PIN_9		18		// ANI18(P147) (DIGITAL_PIN_40)

//#define ANALOG_PIN_6		18		// ANI18
//#define ANALOG_PIN_7		19		// ANI19

/* Port define. */
#define PORT_0				0
#define PORT_1				1
#define PORT_2				2
#define PORT_3				3
#define PORT_4				4
#define PORT_5				5
#define PORT_6				6
#define PORT_7				7
#define PORT_8				8
#define PORT_9				9
#define PORT_10				10
#define PORT_11				11
#define PORT_12				12
#define PORT_13				13
#define PORT_14				14
#define PORT_15				15
#define PORT_16				16
#define PORT_17				17
#define PORT_18				18
#define PORT_19				19



/* Port of digital pin define. */
#define DIGITAL_PIN_0		PORT_0	/* P04	*/
#define DIGITAL_PIN_1		PORT_0	/* P03	*/
#define DIGITAL_PIN_2		PORT_13	/* P137	*/
#define DIGITAL_PIN_3		PORT_4	/* P41	*/
#define DIGITAL_PIN_4		PORT_2	/* P21	*/
#define DIGITAL_PIN_5		DIGITAL_PIN_14	/* P23	*/
#define DIGITAL_PIN_6		DIGITAL_PIN_15	/* P22	*/
#define DIGITAL_PIN_7		PORT_2	/* P20	*/
#define DIGITAL_PIN_8		PORT_4	/* P40	*/
#define DIGITAL_PIN_9		PORT_12	/* P122	*/
#define DIGITAL_PIN_10		PORT_12	/* P121	*/
#define DIGITAL_PIN_11		DIGITAL_PIN_1	/* P03	*/
#define DIGITAL_PIN_12		DIGITAL_PIN_0	/* P04	*/
#define DIGITAL_PIN_13		PORT_0	/* P05	*/
#define DIGITAL_PIN_14		PORT_2	/* P23	*/
#define DIGITAL_PIN_15		PORT_2	/* P22	*/
#define DIGITAL_PIN_16		PORT_0	/* P02	*/
#define DIGITAL_PIN_17		DIGITAL_PIN_13	/* P05	*/
#define DIGITAL_PIN_18		PORT_0	/* P06	*/
#define DIGITAL_PIN_19		PORT_0	/* P07	*/



/* Bit Num of digital pin define */
#define DIGITAL_PIN_BIT_0	0x04	/* P04	*/
#define DIGITAL_PIN_BIT_1	0x03	/* P03	*/
#define DIGITAL_PIN_BIT_2	0x07	/* P137	*/
#define DIGITAL_PIN_BIT_3	0x01	/* P41	*/
#define DIGITAL_PIN_BIT_4	0x01	/* P21	*/
#define DIGITAL_PIN_BIT_5	DIGITAL_PIN_BIT_14	/* P23	*/
#define DIGITAL_PIN_BIT_6	DIGITAL_PIN_BIT_15	/* P22	*/
#define DIGITAL_PIN_BIT_7	0x00	/* P20	*/
#define DIGITAL_PIN_BIT_8	0x00	/* P40	*/
#define DIGITAL_PIN_BIT_9	0x02	/* P122	*/
#define DIGITAL_PIN_BIT_10	0x01	/* P121	*/
#define DIGITAL_PIN_BIT_11	DIGITAL_PIN_BIT_1	/* P03	*/
#define DIGITAL_PIN_BIT_12	DIGITAL_PIN_BIT_0	/* P04	*/
#define DIGITAL_PIN_BIT_13	0x05	/* P05	*/
#define DIGITAL_PIN_BIT_14	0x03	/* P23(REF)	*/
#define DIGITAL_PIN_BIT_15	0x02	/* P22	*/
#define DIGITAL_PIN_BIT_16	0x02	/* P02	*/
#define DIGITAL_PIN_BIT_17	DIGITAL_PIN_BIT_13	/* P05	*/
#define DIGITAL_PIN_BIT_18	0x06	/* P06	*/
#define DIGITAL_PIN_BIT_19	0x07	/* P07	*/
                                


/* Bit mask of digital pin define. */
#define DIGITAL_PIN_MASK_0		0x10	/* P04	*/
#define DIGITAL_PIN_MASK_1		0x08	/* P03	*/
#define DIGITAL_PIN_MASK_2		0x80	/* P137	*/
#define DIGITAL_PIN_MASK_3		0x02	/* P41	*/
#define DIGITAL_PIN_MASK_4		0x02	/* P21	*/
#define DIGITAL_PIN_MASK_5		DIGITAL_PIN_MASK_14	/* P23	*/
#define DIGITAL_PIN_MASK_6		DIGITAL_PIN_MASK_15	/* P22	*/
#define DIGITAL_PIN_MASK_7		0x01	/* P20	*/
#define DIGITAL_PIN_MASK_8		0x01	/* P40	*/
#define DIGITAL_PIN_MASK_9		0x04	/* P122	*/
#define DIGITAL_PIN_MASK_10		0x02	/* P121	*/
#define DIGITAL_PIN_MASK_11		DIGITAL_PIN_MASK_1	/* P03	*/
#define DIGITAL_PIN_MASK_12		DIGITAL_PIN_MASK_0	/* P04	*/
#define DIGITAL_PIN_MASK_13		0x20	/* P05	*/
#define DIGITAL_PIN_MASK_14		0x08	/* P23(REF)	*/
#define DIGITAL_PIN_MASK_15		0x04	/* P22	*/
#define DIGITAL_PIN_MASK_16		0x04	/* P02	*/
#define DIGITAL_PIN_MASK_17		DIGITAL_PIN_MASK_13	/* P05	*/
#define DIGITAL_PIN_MASK_18		0x40	/* P06	*/
#define DIGITAL_PIN_MASK_19		0x80	/* P07	*/



/*  PMC */
#define DIGITAL_PIN_PMC_0		0x10	/* P04	*/
#define DIGITAL_PIN_PMC_1		0x08	/* P03	*/
#define DIGITAL_PIN_PMC_2		0x00	/* P137	*/
#define DIGITAL_PIN_PMC_3		0x00	/* P41	*/
#define DIGITAL_PIN_PMC_4		0x02	/* P21	*/
#define DIGITAL_PIN_PMC_5		DIGITAL_PIN_PMC_14	/* P23	*/
#define DIGITAL_PIN_PMC_6		DIGITAL_PIN_PMC_15	/* P22	*/
#define DIGITAL_PIN_PMC_7		0x01	/* P20	*/
#define DIGITAL_PIN_PMC_8		0x00	/* P40	*/
#define DIGITAL_PIN_PMC_9		0x00	/* P122	*/
#define DIGITAL_PIN_PMC_10		0x00	/* P121	*/
#define DIGITAL_PIN_PMC_11		DIGITAL_PIN_PMC_1	/* P03	*/
#define DIGITAL_PIN_PMC_12		DIGITAL_PIN_PMC_0	/* P04	*/
#define DIGITAL_PIN_PMC_13		0x20	/* P05	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_PMC_14		0x08	/* P23	*/
#define DIGITAL_PIN_PMC_15		0x04	/* P22	*/
#define DIGITAL_PIN_PMC_16		0x04	/* P02	*/
#define DIGITAL_PIN_PMC_17		DIGITAL_PIN_PMC_13	/* P05	*/
#define DIGITAL_PIN_PMC_18		0x00	/* P06	*/
#define DIGITAL_PIN_PMC_19		0x00	/* P07	*/



