renesas/ArduinoCore-rl78g15_fpb_20p/variants/g15-fpb-20p/pins_arduino.h
#if 0
/* Define Digital Pin CCDE */
#define DIGITAL_PIN_CCDE_0		0x00	/* P03	*/
#define DIGITAL_PIN_CCDE_1		0x00	/* P02	*/
#define DIGITAL_PIN_CCDE_2		0x00	/* P43	*/
#define DIGITAL_PIN_CCDE_3		0x00	/* P42	*/
#define DIGITAL_PIN_CCDE_4		0x00	/* P77	*/
#define DIGITAL_PIN_CCDE_5		0x00	/* P41	*/
#define DIGITAL_PIN_CCDE_6		0x00	/* P31	*/
#define DIGITAL_PIN_CCDE_7		0x00	/* P76	*/
#define DIGITAL_PIN_CCDE_8		0x00	/* P73	*/
#define DIGITAL_PIN_CCDE_9		0x00	/* P06	*/
#define DIGITAL_PIN_CCDE_10		0x00	/* P05	*/
#define DIGITAL_PIN_CCDE_11		0x04	/* P51	*/
#define DIGITAL_PIN_CCDE_12		0x08	/* P50	*/
#define DIGITAL_PIN_CCDE_13		0x00	/* P30	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_CCDE_14		0x00
#define DIGITAL_PIN_CCDE_15		0x00
#define DIGITAL_PIN_CCDE_16		0x00
#define DIGITAL_PIN_CCDE_17		0x00


/* Define Digital Pin PDIDIS */
#define DIGITAL_PIN_PDIDIS_0	0x08	/* P03	*/
#define DIGITAL_PIN_PDIDIS_1	0x04	/* P02	*/
#define DIGITAL_PIN_PDIDIS_2	0x00	/* P43	*/
#define DIGITAL_PIN_PDIDIS_3	0x04	/* P42	*/
#define DIGITAL_PIN_PDIDIS_4	0x00	/* P77	*/
#define DIGITAL_PIN_PDIDIS_5	0x00	/* P41	*/
#define DIGITAL_PIN_PDIDIS_6	0x00	/* P31	*/
#define DIGITAL_PIN_PDIDIS_7	0x00	/* P76	*/
#define DIGITAL_PIN_PDIDIS_8	0x00	/* P73	*/
#define DIGITAL_PIN_PDIDIS_9	0x00	/* P06	*/
#define DIGITAL_PIN_PDIDIS_10	0x00	/* P05	*/
#define DIGITAL_PIN_PDIDIS_11	0x00	/* P51	*/
#define DIGITAL_PIN_PDIDIS_12	0x01	/* P50	*/
#define DIGITAL_PIN_PDIDIS_13	0x00	/* P30	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_PDIDIS_14	0x00
#define DIGITAL_PIN_PDIDIS_15	0x00
#define DIGITAL_PIN_PDIDIS_16	0x00
#define DIGITAL_PIN_PDIDIS_17	0x00
#endif



/* Define Digital Pin PM */
#define DIGITAL_PIN_PM_0		0x10	/* P04	*/
#define DIGITAL_PIN_PM_1		0x08	/* P03	*/
#define DIGITAL_PIN_PM_2		0x00	/* P137	*/
#define DIGITAL_PIN_PM_3		0x02	/* P41	*/
#define DIGITAL_PIN_PM_4		0x02	/* P21	*/
#define DIGITAL_PIN_PM_5		DIGITAL_PIN_PM_14	/* P23	*/
#define DIGITAL_PIN_PM_6		DIGITAL_PIN_PM_15	/* P22	*/
#define DIGITAL_PIN_PM_7		0x01	/* P20	*/
#define DIGITAL_PIN_PM_8		0x01	/* P40	*/
#define DIGITAL_PIN_PM_9		0x04	/* P122	*/
#define DIGITAL_PIN_PM_10		0x02	/* P121	*/
#define DIGITAL_PIN_PM_11		DIGITAL_PIN_PM_1	/* P03	*/
#define DIGITAL_PIN_PM_12		DIGITAL_PIN_PM_0	/* P04	*/
#define DIGITAL_PIN_PM_13		0x20	/* P05	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_PM_14		0x08	/* P23(REF)	*/
#define DIGITAL_PIN_PM_15		0x04	/* P22	*/
#define DIGITAL_PIN_PM_16		0x04	/* P02	*/
#define DIGITAL_PIN_PM_17		DIGITAL_PIN_PM_13	/* P05	*/
#define DIGITAL_PIN_PM_18		0x40	/* P06	*/
#define DIGITAL_PIN_PM_19		0x80	/* P07	*/



/* Define Digital Pin PU */
#define DIGITAL_PIN_PU_0		0x10	/* P04	*/
#define DIGITAL_PIN_PU_1		0x08	/* P03	*/
#define DIGITAL_PIN_PU_2		0x00	/* P137	*/
#define DIGITAL_PIN_PU_3		0x02	/* P41	*/
#define DIGITAL_PIN_PU_4		0x02	/* P21	*/
#define DIGITAL_PIN_PU_5		DIGITAL_PIN_PU_14	/* P23	*/
#define DIGITAL_PIN_PU_6		DIGITAL_PIN_PU_15	/* P22	*/
#define DIGITAL_PIN_PU_7		0x01	/* P20	*/
#define DIGITAL_PIN_PU_8		0x01	/* P40	*/
#define DIGITAL_PIN_PU_9		0x04	/* P122	*/
#define DIGITAL_PIN_PU_10		0x02	/* P121	*/
#define DIGITAL_PIN_PU_11		DIGITAL_PIN_PU_1	/* P03	*/
#define DIGITAL_PIN_PU_12		DIGITAL_PIN_PU_0	/* P04	*/
#define DIGITAL_PIN_PU_13		0x20	/* P05	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_PU_14		0x08	/* P23	*/
#define DIGITAL_PIN_PU_15		0x04	/* P22	*/
#define DIGITAL_PIN_PU_16		0x04	/* P02	*/
#define DIGITAL_PIN_PU_17		DIGITAL_PIN_PU_13	/* P05	*/
#define DIGITAL_PIN_PU_18		0x40	/* P06	*/
#define DIGITAL_PIN_PU_19		0x80	/* P07	*/


#if 0
/* Define Digital Pin PIM */
#define DIGITAL_PIN_PIM_0		0x10	/* P04	*/
#define DIGITAL_PIN_PIM_1		0x08	/* P03	*/
#define DIGITAL_PIN_PIM_2		0x80	/* P137	*/
#define DIGITAL_PIN_PIM_3		0x02	/* P41	*/
#define DIGITAL_PIN_PIM_4		0x02	/* P21	*/
#define DIGITAL_PIN_PIM_5		0x08	/* P23	*/
#define DIGITAL_PIN_PIM_6		0x04	/* P22	*/
#define DIGITAL_PIN_PIM_7		0x01	/* P20	*/
#define DIGITAL_PIN_PIM_8		0x01	/* P40	*/
#define DIGITAL_PIN_PIM_9		0x04	/* P122	*/
#define DIGITAL_PIN_PIM_10		0x02	/* P121	*/
#define DIGITAL_PIN_PIM_11		0x08	/* P03	*/
#define DIGITAL_PIN_PIM_12		0x10	/* P04	*/
#define DIGITAL_PIN_PIM_13		0x20	/* P05	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_PIM_14		0x08	/* P23(REF)	*/
#define DIGITAL_PIN_PIM_15		0x04	/* P22	*/
#define DIGITAL_PIN_PIM_16		0x04	/* P02	*/
#define DIGITAL_PIN_PIM_17		0x20	/* P05	*/
#endif


/* Define Digital Pin POM */
#define DIGITAL_PIN_POM_0		0x10	/* P04	*/
#define DIGITAL_PIN_POM_1		0x08	/* P03	*/
#define DIGITAL_PIN_POM_2		0x00	/* P137	*/
#define DIGITAL_PIN_POM_3		0x02	/* P41	*/
#define DIGITAL_PIN_POM_4		0x00	/* P21	*/
#define DIGITAL_PIN_POM_5		DIGITAL_PIN_POM_14	/* P23	*/
#define DIGITAL_PIN_POM_6		DIGITAL_PIN_POM_15	/* P22	*/
#define DIGITAL_PIN_POM_7		0x00	/* P20	*/
#define DIGITAL_PIN_POM_8		0x00	/* P40	*/
#define DIGITAL_PIN_POM_9		0x00	/* P122	*/
#define DIGITAL_PIN_POM_10		0x00	/* P121	*/
#define DIGITAL_PIN_POM_11		DIGITAL_PIN_POM_1	/* P03	*/
#define DIGITAL_PIN_POM_12		DIGITAL_PIN_POM_0	/* P04	*/
#define DIGITAL_PIN_POM_13		0x20	/* P05	*/
/* 追加(仮)　*/
#define DIGITAL_PIN_POM_14		0x00	/* P23(REF)	*/
#define DIGITAL_PIN_POM_15		0x04	/* P22	*/
#define DIGITAL_PIN_POM_16		0x00	/* P02	*/
#define DIGITAL_PIN_POM_17		DIGITAL_PIN_POM_13	/* P05	*/
#define DIGITAL_PIN_POM_18		0x40	/* P06	*/
#define DIGITAL_PIN_POM_19		0x80	/* P07	*/



#endif

#define PWM_PIN_11			0xE0	// Software PWM0
#define PWM_PIN_22			0xE1	// Software PWM1
#define PWM_PIN_23			0xE2	// Software PWM2
#define PWM_PIN_24			0xE3	// Software PWM3

#define SWPWM_PIN			0xE0
/* 1006 Nhu add */
#define PWM_PIN_0			0		// TO1
#define PWM_PIN_3			3		// TO3
#define PWM_PIN_13			13		// TO2

#define PWM_PIN_5			5		// TO7
#define PWM_PIN_6			6		// TO3
#define PWM_PIN_9			9		// TO6
#define PWM_PIN_10			10		// TO5
#define PWM_PIN_31			31		// TO2
#define PWM_PIN_32			32		// TO1
/* 1006 Nhu add */
/* Define Serial Port Number */
#define SERIAL_TXD0			36 // P12
#define SERIAL_RXD0			37 // P11

#define SERIAL_TXD1			1  // P02
#define SERIAL_RXD1			0  // P03

#define SERIAL_TXD2			35 // P13
#define SERIAL_RXD2			34 // P14
/* Define Serial Port Number */


// #ifdef ARDUINO_MAIN

// On the Arduino board, digital pins are also used
// for the analog output (software PWM).  Analog input
// pins are a separate set.

